<?php

namespace App\Service\TelegramExchangeBot\Commands;

class FaqCommand extends AbstractCommand implements CommandInterface
{
    /**
     * @return void
     */
    public function execute(): void
    {
        $output = '<b>💬 Відповіді на питання, що часто ставляться</b>';
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Ви використовуєте перевірку AML?</b>" . PHP_EOL;
        $output .= "Так, ми використовуємо AML перевірку криптовалюти на наявність ризиків.Така перевірка виявляє криптовалюту, яка була вкрадена у її власників, отримана шахрайським шляхом, проходила через МіКСЕР або була задіяна у продажу заборонених товарів на майданчиках Darknet.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи обов’язково реєструватися на сайти для здійснення обміну?</b>" . PHP_EOL;
        $output .= "Ні, не обов'язково. Реєстрація значно полегшує здійснення обміну, так як вам не потрібно кожен раз заново вводити дані, але наголошуємо, що вона не є обов'язковою.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи є у вас автоматичний обмін?</b>" . PHP_EOL;
        $output .= "Так, наш сервіс повністю автоматизував прийом Bitcoin, Etherium, USDT, Doge, Litecoin і виплату коштів на банківську карту. Автоматизовані більшість напрямків, наприклад виведення та поповнення криптовалют.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Що таке автоматичний обмін?</b>" . PHP_EOL;
        $output .= "Це обмін в процес якого не втручається оператор, абсолютно весь процес контролюється системою.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Як відбувається автообмін BTC з виплатою на банківську картку?</b>" . PHP_EOL;
        $output .= "Насамперед ви заповнюєте заявку, після чого оплачуєте точну суму на вказаний гаманець. При появі транзакції в мережі фіксується курс і сума виплати по заявці. Після 1-го підтвердження гроші автоматично відправляються на карту.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Як відбувається автообмін USDT з виплатою на банківську карту?</b>" . PHP_EOL;
        $output .= 'Насамперед ви заповнюєте заявку, після чого оплачуєте точну суму на вказаний гаманець. Як тільки буде виконано 12 підтверджень мережі, сума по заявці буде негайно відправлена на вашу банківську картку.';
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Як відбувається автообмін ETH з виплатою на банківську картку?</b>" . PHP_EOL;
        $output .= 'Насамперед ви заповнюєте заявку, після чого оплачуєте точну суму на вказаний гаманець. Залишається зачекати 8 підтверджень мережі, після чого грошові кошти будуть відправлені на Вашу банківську картку.';
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Як відбувається автообмін Capitalist з виплатою на банківську картку?</b>" . PHP_EOL;
        $output .= 'Клієнту достатньо обрати напрямок, вказати точну суму, яку він планує обміняти. Як тільки електронні гроші надійдуть на наш гаманець, система одразу ж відправить вам необхідну суму.';
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 На скільки точною повинна бути сума при відправці криптовалют?</b>" . PHP_EOL;
        $output .= 'Сума повинна бути такою самою яка зазначена в заявці, при неточній сумі сервіс не зможе гарантувати автоматичне виконання заявки.';
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Я відправив меньше BTC ніж вказано в заявці, що робити?</b>" . PHP_EOL;
        $output .= "Насамперед не хвилюйтесь, доплатіть різницю, за тої умови що сумарно 2 платежі повинні відповідати сумі заявки. Якщо такої можливості немає - зв'яжіться зі службою підтримки для ручної обробки заявки.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Я відправив більше BTC ніж вказано в заявці, що робити?</b>" . PHP_EOL;
        $output .= "Система автоматично закриває заявку і здійснює оплату по кількості криптовалюти вказаної у заявці. Щоб отримати назад різницю чи доплату на карту - зв'яжіться з підтримкою, виплата або повернення будуть виконані в ручному режимі.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи можна через ваш сервіс здійснити реєстрові/масові поповнення?</b>" . PHP_EOL;
        $output .= "Так, наш сервіс ввів таку послугу. Можна здійснити масове поповнення переліку банківських карт використовуючи криптовалюти чи грошові знаки платіжних систем.";
        $this->sendMessage($output);

        $output = PHP_EOL . PHP_EOL . "<b>🔸 Як виконати автоообмін з масовим поповненням банківських карт?</b>" . PHP_EOL;
        $output .= "Необхідно створити заявку, вказавши перелік карт і сум до зарахування. Після чого оплатити заявку. Обробка заявки буде здійснена в ручному режимі, а виплата - в автоматичному.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи можна відмінити заявку?</b>" . PHP_EOL;
        $output .= "Виконана заявка є незворотньою, тобто по такій заявці кошти поверненню не підлягають. Якщо заявка оплачена, але не виконана, Ви можете повернути свої кошти (за вирахуванням комісії за перевод), написавши в службу підтримки у розділі “Контакти”.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи можна оплатити заявку напряму на ваш гаманець?</b>" . PHP_EOL;
        $output .= "Категоричне ні. Тільки через заявку на сайті. Прямі платежі будуть повернуті з урахуванням комісії за перевод.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чи можна обміняти більше ніж зазначено у резерві?</b>" . PHP_EOL;
        $output .= "Так можна. Вам необхідно буде оформити заявку, як тільки кошти будуть доступні, Вам буде вислане повідомлення на e-mail, де буде зазначено посилання для продовження обміну.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Які у вас комісії?</b>" . PHP_EOL;
        $output .= "Всі наші комісії уже включені в обмін і відображаються на стадії оформлення заявки, за виключенням комісій які може знімати ваш банк при зарахуванні грошових коштів на вашу карту.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Я зазначив невірний номер гаманця для отримання коштів. Що робити?</b>" . PHP_EOL;
        $output .= "На жаль, виконані платежі відмінити неможливо. В залежності від направлення, якщо кошти не будуть відправлені, то ми повернем їх за вирахуванням комісій за переказ. У всіх інших випадках обмін буде рахуватись здійсненим.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Як швидко я отримаю свої гроші/криптовалюту?</b>" . PHP_EOL;
        $output .= "Сервіс обробляє заявку на ввід/вивід коштів миттєво, але специфіка роботи в мережі Bitcoin або інших криптовалют має на увазі необхідність підтвердження угоди і в залежності від блокчейна і його роботи це може зайняти від декілька хвилин до 24 годин. Якщо блокчейн затримує транзакції, будь-ласка, наберіться терпіння і пам'ятайте, що ми не можемо на це ніяк вплинути.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 До мене звернулися через Skype/Telegram/Viber і запропонували провести обмін по вигідному курсу від вашого імені. Це можливо?</b>" . PHP_EOL;
        $output .= "Ми не проводимо обміни через месенджери, телефон, пошту та інші засоби зв'язку. Будь-який обмін на нашому сервісі проводиться згідно процедури створення заявки на сайті.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Що таке хеш транзакції?</b>" . PHP_EOL;
        $output .= "Кожна транзакція, яка включена в Blockchain, має свій власний унікальний ідентифікатор, який називається хеш (також називається “tx”). Цей унікальний код дозволяє перевірити достовірність транзакції у відкритому Blokchain.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Які є способи отримання готівки?</b>" . PHP_EOL;
        $output .= "Ви можете отримати готівку у комфортному та безпечному офісі в м. Києві а також в інших регіонах України. Є послуга кур'єрської доставки.";
        $output .= PHP_EOL . PHP_EOL . "<b>🔸 Чому мені треба довіряти вашому сервісу?</b>" . PHP_EOL;
        $output .= "Висока швидкість обробки, конфіденційність даних, команда справжніх професіоналів, резерви під різні задачі. Ми надамо гідний сервіс навіть найвибагливішим клієнтам.";

        $this->sendMessage($output);
    }
}